Zetaohm/DaisyPod_Platformio_Example/platforms/ststm32/misc/svd/STM32WBxx.svd
            <register>
               <name>C10CR</name>
               <displayName>C10CR</displayName>
               <description>DMA Multiplexer Channel 10 Control           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>SYNC_ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Nb request</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Sync polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event Generation Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization Overrun Interrupt               Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA Request ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C11CR</name>
               <displayName>C11CR</displayName>
               <description>DMA Multiplexer Channel 11 Control           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>SYNC_ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Nb request</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Sync polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event Generation Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization Overrun Interrupt               Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA Request ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C12CR</name>
               <displayName>C12CR</displayName>
               <description>DMA Multiplexer Channel 12 Control           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>SYNC_ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Nb request</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Sync polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event Generation Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization Overrun Interrupt               Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA Request ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C13CR</name>
               <displayName>C13CR</displayName>
               <description>DMA Multiplexer Channel 13 Control           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC_ID</name>
                     <description>SYNC_ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NBREQ</name>
                     <description>Nb request</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SPOL</name>
                     <description>Sync polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SE</name>
                     <description>Synchronization enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EGE</name>
                     <description>Event Generation Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOIE</name>
                     <description>Synchronization Overrun Interrupt               Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAREQ_ID</name>
                     <description>DMA Request ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>DMA Multiplexer Channel Status           register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOF0</name>
                     <description>Synchronization Overrun Flag               0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF1</name>
                     <description>Synchronization Overrun Flag               1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF2</name>
                     <description>Synchronization Overrun Flag               2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF3</name>
                     <description>Synchronization Overrun Flag               3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF4</name>
                     <description>Synchronization Overrun Flag               4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF5</name>
                     <description>Synchronization Overrun Flag               5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF6</name>
                     <description>Synchronization Overrun Flag               6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF7</name>
                     <description>Synchronization Overrun Flag               7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF8</name>
                     <description>Synchronization Overrun Flag               8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF9</name>
                     <description>Synchronization Overrun Flag               9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF10</name>
                     <description>Synchronization Overrun Flag               10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF11</name>
                     <description>Synchronization Overrun Flag               11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF12</name>
                     <description>Synchronization Overrun Flag               12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOF13</name>
                     <description>Synchronization Overrun Flag               13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFR</name>
               <displayName>CFR</displayName>
               <description>DMA Channel Clear Flag           Register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSOF0</name>
                     <description>Synchronization Clear Overrun Flag               0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF1</name>
                     <description>Synchronization Clear Overrun Flag               1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF2</name>
                     <description>Synchronization Clear Overrun Flag               2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF3</name>
                     <description>Synchronization Clear Overrun Flag               3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF4</name>
                     <description>Synchronization Clear Overrun Flag               4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF5</name>
                     <description>Synchronization Clear Overrun Flag               5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF6</name>
                     <description>Synchronization Clear Overrun Flag               6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF7</name>
                     <description>Synchronization Clear Overrun Flag               7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF8</name>
                     <description>Synchronization Clear Overrun Flag               8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF9</name>
                     <description>Synchronization Clear Overrun Flag               9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF10</name>
                     <description>Synchronization Clear Overrun Flag               10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF11</name>
                     <description>Synchronization Clear Overrun Flag               11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF12</name>
                     <description>Synchronization Clear Overrun Flag               12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSOF13</name>
                     <description>Synchronization Clear Overrun Flag               13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG0CR</name>
               <displayName>RG0CR</displayName>
               <description>DMA Request Generator 0 Control           Register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of Request</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>Generation Polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>Generation Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Overrun Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG1CR</name>
               <displayName>RG1CR</displayName>
               <description>DMA Request Generator 1 Control           Register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of Request</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>Generation Polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>Generation Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Overrun Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RG2CR</name>
               <displayName>RG2CR</displayName>
               <description>DMA Request Generator 2 Control           Register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GNBREQ</name>
                     <description>Number of Request</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>GPOL</name>
                     <description>Generation Polarity</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GE</name>
                     <description>Generation Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OIE</name>
                     <description>Overrun Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIG_ID</name>
                     <description>Signal ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
