Zetaohm/DaisyPod_Platformio_Example/platforms/ststm32/misc/svd/STM32WBxx.svd
            <register>
               <name>C2APB2SMENR</name>
               <displayName>C2APB2SMENR</displayName>
               <description>CPU2 APB2SMENR</description>
               <addressOffset>0x180</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00265800</resetValue>
               <fields>
                  <field>
                     <name>SAI1SMEN</name>
                     <description>SAI1 clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM17SMEN</name>
                     <description>TIM17 timer clocks enable during CPU2               Sleep mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16SMEN</name>
                     <description>TIM16 timer clocks enable during CPU2               Sleep mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SMEN</name>
                     <description>USART1clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1SMEN</name>
                     <description>SPI1 clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1SMEN</name>
                     <description>TIM1 timer clocks enable during CPU2               Sleep mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB3SMENR</name>
               <displayName>C2APB3SMENR</displayName>
               <description>CPU2 APB3SMENR</description>
               <addressOffset>0x184</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000003</resetValue>
               <fields>
                  <field>
                     <name>SMEN802</name>
                     <description>802.15.4 interface clocks enable during               CPU2 Sleep modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLESMEN</name>
                     <description>BLE interface clocks enable during CPU2               Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PWR</name>
         <description>Power control</description>
         <groupName>PWR</groupName>
         <baseAddress>0x58000400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PWR_SOTF</name>
            <description>PWR switching on the fly
        interrupt</description>
            <value>43</value>
         </interrupt>
         <registers>
            <register>
               <name>CR1</name>
               <displayName>CR1</displayName>
               <description>Power control register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>LPR</name>
                     <description>Low-power run</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VOS</name>
                     <description>Voltage scaling range               selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DBP</name>
                     <description>Disable backup domain write               protection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPDS</name>
                     <description>Flash power down mode during LPsSleep               for CPU1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPDR</name>
                     <description>Flash power down mode during LPRun for               CPU1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPMS</name>
                     <description>Low-power mode selection for               CPU1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <displayName>CR2</displayName>
               <description>Power control register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>USV</name>
                     <description>VDDUSB USB supply valid</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVME3</name>
                     <description>Peripheral voltage monitoring 3 enable:               VDDA vs. 1.62V</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVME1</name>
                     <description>Peripheral voltage monitoring 1 enable:               VDDUSB vs. 1.2V</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLS</name>
                     <description>Power voltage detector level               selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PVDE</name>
                     <description>Power voltage detector               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR3</name>
               <displayName>CR3</displayName>
               <description>Power control register 3</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>EIWUL</name>
                     <description>Enable internal wakeup line for               CPU1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EC2H</name>
                     <description>Enable CPU2 Hold interrupt for               CPU1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>E802A</name>
                     <description>Enable end of activity interrupt for               CPU1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EBLEA</name>
                     <description>Enable BLE end of activity interrupt for               CPU1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECRPE</name>
                     <description>Enable critical radio phase end of               activity interrupt for CPU1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>APC</name>
                     <description>Apply pull-up and pull-down               configuration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RRS</name>
                     <description>SRAM2a retention in Standby               mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EBORHSDFB</name>
                     <description>Enable BORH and Step Down counverter               forced in Bypass interrups for CPU1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP5</name>
                     <description>Enable Wakeup pin WKUP5</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP4</name>
                     <description>Enable Wakeup pin WKUP4</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP3</name>
                     <description>Enable Wakeup pin WKUP3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP2</name>
                     <description>Enable Wakeup pin WKUP2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP1</name>
                     <description>Enable Wakeup pin WKUP1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR4</name>
               <displayName>CR4</displayName>
               <description>Power control register 4</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>C2BOOT</name>
                     <description>BOOT CPU2 after reset or wakeup from               Stop or Standby modes</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBRS</name>
                     <description>VBAT battery charging resistor               selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBE</name>
                     <description>VBAT battery charging               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP5</name>
                     <description>Wakeup pin WKUP5 polarity</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP4</name>
                     <description>Wakeup pin WKUP4 polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP3</name>
                     <description>Wakeup pin WKUP3 polarity</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP2</name>
                     <description>Wakeup pin WKUP2 polarity</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP1</name>
                     <description>Wakeup pin WKUP1 polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR1</name>
               <displayName>SR1</displayName>
               <description>Power status register 1</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUFI</name>
                     <description>Internal Wakeup interrupt               flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>C2HF</name>
                     <description>CPU2 Hold interrupt flag</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AF802</name>
                     <description>802.15.4 end of activity interrupt               flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLEAF</name>
                     <description>BLE end of activity interrupt               flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRPEF</name>
                     <description>Enable critical radio phase end of               activity interrupt flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>802WUF</name>
                     <description>802.15.4 wakeup interrupt               flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLEWUF</name>
                     <description>BLE wakeup interrupt flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORHF</name>
                     <description>BORH interrupt flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDFBF</name>
                     <description>Step Down converter forced in Bypass               interrupt flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWUF5</name>
                     <description>Wakeup flag 5</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWUF4</name>
                     <description>Wakeup flag 4</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWUF3</name>
                     <description>Wakeup flag 3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWUF2</name>
                     <description>Wakeup flag 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CWUF1</name>
                     <description>Wakeup flag 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR2</name>
               <displayName>SR2</displayName>
               <description>Power status register 2</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>PVMO3</name>
                     <description>Peripheral voltage monitoring output:               VDDA vs. 1.62 V</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVMO1</name>
                     <description>Peripheral voltage monitoring output:               VDDUSB vs. 1.2 V</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVDO</name>
                     <description>Power voltage detector               output</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VOSF</name>
                     <description>Voltage scaling flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REGLPF</name>
                     <description>Low-power regulator flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REGLPS</name>
                     <description>Low-power regulator               started</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDSMPSF</name>
                     <description>Step Down converter SMPS mode               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDBF</name>
                     <description>Step Down converter Bypass mode               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
