Zetaohm/DaisyPod_Platformio_Example/platforms/ststm32/misc/svd/STM32WBxx.svd
            <register>
               <name>SUSP2R</name>
               <displayName>SUSP2R</displayName>
               <description>AES suspend register 2</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP2R</name>
                     <description>AES suspend register 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP3R</name>
               <displayName>SUSP3R</displayName>
               <description>AES suspend register 3</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP3R</name>
                     <description>AES suspend register 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP4R</name>
               <displayName>SUSP4R</displayName>
               <description>AES suspend register 4</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP4R</name>
                     <description>AES suspend register 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP5R</name>
               <displayName>SUSP5R</displayName>
               <description>AES suspend register 5</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP5R</name>
                     <description>AES suspend register 5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP6R</name>
               <displayName>SUSP6R</displayName>
               <description>AES suspend register 6</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP6R</name>
                     <description>AES suspend register 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUSP7R</name>
               <displayName>SUSP7R</displayName>
               <description>AES suspend register 7</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES_SUSP7R</name>
                     <description>AES suspend register 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFR</name>
               <displayName>HWCFR</displayName>
               <description>AES hardware configuration           register</description>
               <addressOffset>0x3F0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>CFG4</name>
                     <description>HW Generic 4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CFG3</name>
                     <description>HW Generic 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CFG2</name>
                     <description>HW Generic 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CFG1</name>
                     <description>HW Generic 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERR</name>
               <displayName>VERR</displayName>
               <description>AES version register</description>
               <addressOffset>0x3F4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>MAJREV</name>
                     <description>Major revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MINREV</name>
                     <description>Minor revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPIDR</name>
               <displayName>IPIDR</displayName>
               <description>AES identification register</description>
               <addressOffset>0x3F8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00170023</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Identification code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIDR</name>
               <displayName>SIDR</displayName>
               <description>AES size ID register</description>
               <addressOffset>0x3FC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0xA3C5DD01</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Size Identification code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
