Zetaohm/DaisyPod_Platformio_Example/platforms/ststm32/misc/svd/STM32WBxx.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="GPIOC">
         <name>GPIOD</name>
         <baseAddress>0x48000C00</baseAddress>
      </peripheral>
      <peripheral>
         <name>GPIOE</name>
         <description>General-purpose I/Os</description>
         <groupName>GPIO</groupName>
         <baseAddress>0x48001000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MODER</name>
               <displayName>MODER</displayName>
               <description>GPIO port mode register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000003FF</resetValue>
               <fields>
                  <field>
                     <name>MODER4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTYPER</name>
               <displayName>OTYPER</displayName>
               <description>GPIO port output type register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OT4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSPEEDR</name>
               <displayName>OSPEEDR</displayName>
               <description>GPIO port output speed           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000C0</resetValue>
               <fields>
                  <field>
                     <name>OSPEEDR4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUPDR</name>
               <displayName>PUPDR</displayName>
               <description>GPIO port pull-up/pull-down           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PUPDR4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PUPDR0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <displayName>IDR</displayName>
               <description>GPIO port input data register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IDR4</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDR3</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDR2</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDR1</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDR0</name>
                     <description>Port input data (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ODR</name>
               <displayName>ODR</displayName>
               <description>GPIO port output data register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ODR4</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR3</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR2</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR1</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ODR0</name>
                     <description>Port output data (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BSRR</name>
               <displayName>BSRR</displayName>
               <description>GPIO port bit set/reset           register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BR4</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR3</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR2</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR1</name>
                     <description>Port x reset bit y (y =               0..15)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR0</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS4</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS3</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS2</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS1</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BS0</name>
                     <description>Port x set bit y (y=               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LCKR</name>
               <displayName>LCKR</displayName>
               <description>GPIO port configuration lock           register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LCKK</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK4</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK3</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK2</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK1</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCK0</name>
                     <description>Port x lock bit y (y=               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFRL</name>
               <displayName>AFRL</displayName>
               <description>GPIO alternate function low           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AFSEL4</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL3</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL2</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL1</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL0</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFRH</name>
               <displayName>AFRH</displayName>
               <description>GPIO alternate function high           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AFSEL15</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL14</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL13</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL12</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL11</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL10</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL9</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFSEL8</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BRR</name>
               <displayName>BRR</displayName>
               <description>port bit reset register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BR0</name>
                     <description>Port Reset bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR1</name>
                     <description>Port Reset bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR2</name>
                     <description>Port Reset bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR3</name>
                     <description>Port Reset bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BR4</name>
                     <description>Port Reset bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
