Zetaohm/DaisyPod_Platformio_Example/platforms/ststm32/misc/svd/STM32WBxx.svd
            <register>
               <name>HWCFGR3</name>
               <displayName>HWCFGR3</displayName>
               <description>Hardware configuration           registers</description>
               <addressOffset>0x3E8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000302</resetValue>
               <fields>
                  <field>
                     <name>EVENT_TRG</name>
                     <description>HW configuration event trigger               type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR4</name>
               <displayName>HWCFGR4</displayName>
               <description>Hardware configuration           registers</description>
               <addressOffset>0x3E4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EVENT_TRG</name>
                     <description>HW configuration event trigger               type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR1</name>
               <displayName>HWCFGR1</displayName>
               <description>Hardware configuration register           1</description>
               <addressOffset>0x3F0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00003130</resetValue>
               <fields>
                  <field>
                     <name>NBEVENTS</name>
                     <description>HW configuration number of               event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NBCPUS</name>
                     <description>HW configuration number of               CPUs</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CPUEVTEN</name>
                     <description>HW configuration of CPU(m) event output               enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERR</name>
               <displayName>VERR</displayName>
               <description>EXTI IP Version register</description>
               <addressOffset>0x3F4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0X00000020</resetValue>
               <fields>
                  <field>
                     <name>MINREV</name>
                     <description>Minor Revision number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MAJREV</name>
                     <description>Major Revision number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPIDR</name>
               <displayName>IPIDR</displayName>
               <description>Identification register</description>
               <addressOffset>0x3F8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x000E0001</resetValue>
               <fields>
                  <field>
                     <name>IPID</name>
                     <description>IP Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIDR</name>
               <displayName>SIDR</displayName>
               <description>Size ID register</description>
               <addressOffset>0x3FC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0xA3C5DD01</resetValue>
               <fields>
                  <field>
                     <name>SID</name>
                     <description>Size Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>CRS</name>
         <description>Clock recovery system</description>
         <groupName>CRS</groupName>
         <baseAddress>0x40006000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CRS_IT</name>
            <description>CRS interrupt</description>
            <value>42</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>CRS control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00002000</resetValue>
               <fields>
                  <field>
                     <name>SYNCOKIE</name>
                     <description>SYNC event OK interrupt               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCWARNIE</name>
                     <description>SYNC warning interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Synchronization or trimming error               interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESYNCIE</name>
                     <description>Expected SYNC interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEN</name>
                     <description>Frequency error counter               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTOTRIMEN</name>
                     <description>Automatic trimming enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWSYNC</name>
                     <description>Automatic trimming enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIM</name>
                     <description>HSI48 oscillator smooth               trimming</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>CRS configuration register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x2022BB7F</resetValue>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>Counter reload value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FELIM</name>
                     <description>Frequency error limit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SYNCDIV</name>
                     <description>SYNCDIV</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SYNCSRC</name>
                     <description>SYNC signal source               selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SYNCPOL</name>
                     <description>SYNC polarity selection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>CRS interrupt and status           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNCOKF</name>
                     <description>SYNC event OK flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCWARNF</name>
                     <description>SYNC warning flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRF</name>
                     <description>Error flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESYNCF</name>
                     <description>Expected SYNC flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCERR</name>
                     <description>SYNC error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCMISS</name>
                     <description>SYNC missed</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOVF</name>
                     <description>Trimming overflow or               underflow</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEDIR</name>
                     <description>Frequency error direction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FECAP</name>
                     <description>Frequency error capture</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>CRS interrupt flag clear           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNCOKC</name>
                     <description>SYNC event OK clear flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCWARNC</name>
                     <description>warning clear flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRC</name>
                     <description>Error clear flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESYNCC</name>
                     <description>Expected SYNC clear flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
